const skillList = [
  {
    id : 0,
    title : 'HTML5',
    percent : 90,
    text : '웹 표준과 웹 접근성을 준수하고 HTML에서 권장하는 마크업 방식과 시맨틱 태그를 사용해 레이아웃을 설계할 수 있습니다.<br>퍼블리싱을 하기 전 작성한 기획서에 있는 와이어프레임과 상호작용 여부에 맞게 체계적으로 퍼블리싱 작업을 수행할 수 있습니다.',
  },
  {
    id : 1,
    title : 'Figma',
    percent : 85,
    text : 'Figma를 이용해 아이콘을 제작하고 웹사이트 UI 디자인 작업을 할 수 있습니다. 공유된 URL을 이용해 팀원과 함께 디자인 작업과 디자인에 대한 피드백 과정을 원활하게 할 수 있습니다. 간단한 호버 효과를 적용할 수 있어 상호작용을 디자인 과정에서 보여줄 수 있습니다.',
  },
  {
    id : 2,
    title : 'CSS3',
    percent : 90,
    text : '기획서에 작성된 폰트 서식과 컬러 가이드, 사이즈 정보, 상호작용 여부를 기준으로 퍼블리싱 할 수 있습니다.<br>기획서의 요소들을 :root 가상 클래스에 정리하여 체계적으로 사용할 수 있습니다.<p style="font-size: var(--fontSize28); margin-top: 1rem;">Responsive Web</p>기존 방식인 float, position, media query와 함께 flex, grid 레이아웃 방식을 활용한 웹 사이트를 제작할 수 있습니다.',
  },
  {
    id : 3,
    title : 'Illustrator',
    percent : 80,
    text : '웹사이트 UI 디자인 작업에 사용할 아이콘과 간단한 일러스트를 제작할 수 있습니다. 일러스트의 3d 이펙트를 이용해 트렌디한 이미지를 제작해 사용할 수 있습니다.<br>일러스트을 이용해 와이어프레임과 그 레이아웃에 맞는 UI 디자인을 할 수 있습니다.',
  },
  {
    id : 4,
    title : 'JavaScript',
    percent : 80,
    text : '내비게이션, 탭 메뉴, 아코디언 등을 자바스크립트로 제작할 수 있습니다. 객체 배열을 만들어 자바스크립트로 불러와 HTML에 내보낼 수 있습니다.<br>반복되는 형태의 HTML에 들어갈 내용을 반복문을 이용해 간단하게 처리할 수 있습니다. 스와이퍼 슬라이드 등의 플러그인을 사용해 커스텀 할 수 있습니다.<br>공공 API의 데이터를 불러와 커스텀 해서 사용할 수 있습니다.',
  },
  {
    id : 5,
    title : 'Photoshop',
    percent : 70,
    text : '웹 사이트에 사용해야하는 이미지의 간단한 편집을 할 수 있습니다. 이미지의 배경을 지우거나 부분부분을 합성할 수 있습니다. 레이어의 개념을 이해하고 있습니다.<br>전문적인 편집기술을 가지지는 않았지만 웹 사이트에 사용할 정도의 편집기술을 가지고 있습니다.',
  },
  {
    id : 6,
    title : 'React',
    percent : 40,
    text : '무료 API를 이용해 리액트에서 커스텀해 보았고 임시데이터를 이용해 쇼핑몰 형태를 만들어 필터를 적용해 보았습니다.<br>라우터를 사용해 링크를 연결해 특정 부분만 렌더링할 수 있습니다.',
  },
  {
    id : 7,
    title : 'Office',
    percent : 90,
    text : '기획서를 만들기 위해 파워포인트와 구글 슬라이드를 사용할 수 있습니다. 파워포인트로 짧은 동영상을 만들 수 있고 기획서를 가독성 좋게 정리해 만들 수 있습니다.<br> 엑셀과 한글 등을 사용해 자료를 정리할 수 있습니다.',
  },
]